{"resourceType":"ValueSet","expansion":{"identifier":"urn:uuid:3e4d1fe2-b19e-4a4c-885d-a92e3df5783a","timestamp":"2016-03-09T12:49:14Z","contains":[{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Regions of Interest (ROI) within a subject Act. Primarily used for making secondary observations on a subset of a subject observation. The relationship between a ROI and its referenced Act is specified through an ActRelationship of type \"subject\" (SUBJ), which must always be present."}],"system":"http://hl7.org/fhir/v3/ActClass","code":"_ActClassROI","display":"ActClassROI"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A Region of Interest (ROI) specified for a multidimensional observation, such as an Observation Series (OBSSER). The ROI is specified using a set of observation criteria, each delineating the boundary of the region in one of the dimensions in the multidimensional observation. The relationship between a ROI and its referenced Act is specified through an ActRelationship of type subject (SUBJ), which must always be present. Each of the boundary criteria observations is connected with the ROI using ActRelationships of type \"has component\" (COMP). In each boundary criterion, the Act.code names the dimension and the Observation.value specifies the range of values inside the region. Typically the bounded dimension is continuous, and so the Observation.value will be an interval (IVL) data type. The Observation.value need not be specified if the respective dimension is only named but not constrained. For example, an ROI for the QT interval of a certain beat in ECG Lead II would contain 2 boundary criteria, one naming the interval in time (constrained), and the other naming the interval in ECG Lead II (only named, but not constrained)."}],"system":"http://hl7.org/fhir/v3/ActClass","code":"ROIBND","display":"bounded ROI"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A Region of Interest (ROI) specified for an image using an overlay shape. Typically used to make reference to specific regions in images, e.g. to specify the location of a radiologic finding in an image or to specify the site of a physical finding by \"circling\" a region in a schematic picture of a human body. The units of the coordinate values are in pixels.  The origin is in the upper left hand corner, with positive X values going to the right and positive Y values going down. The relationship between a ROI and its referenced Act is specified through an ActRelationship of type \"subject\" (SUBJ), which must always be present."}],"system":"http://hl7.org/fhir/v3/ActClass","code":"ROIOVL","display":"overlay ROI"}]}}