{"resourceType":"ValueSet","expansion":{"identifier":"urn:uuid:e52bbd53-caaa-41bc-9a5f-2bb2a057fb10","timestamp":"2016-03-07T21:50:24Z","contains":[{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Specifies under what circumstances (target Act) the source-Act may, must, must not or has occurred"}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"_ActRelationshipConditional","display":"ActRelationshipConditional"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A contraindication is just a negation of a reason, i.e. it gives a condition under which the action is not to be done. Both, source and target can be any kind of service; target service is in criterion mood. How the strength of a contraindication is expressed (e.g. relative, absolute) is left as an open issue. The priorityNumber attribute could be used."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"CIND","display":"has contra-indication"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A requirement to be true before a service is performed. The target can be any service in criterion mood.  For multiple pre-conditions a conjunction attribute (AND, OR, XOR) is applicable."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"PRCN","display":"has pre-condition"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The reason or rationale for a service. A reason link is weaker than a trigger, it only suggests that some service may be or might have been a reason for some action, but not that this reason requires/required the action to be taken. Also, as opposed to the trigger, there is no strong timely relation between the reason and the action.  As well as providing various types of information about the rationale for a service, the RSON act relationship is routinely used between a SBADM act and an OBS act to describe the indication for use of a medication.  Child concepts may be used to describe types of indication.                                                       Discussion: In prior releases, the code \"SUGG\" (suggests) was expressed as \"an inversion of the reason link.\" That code has been retired in favor of the inversion indicator that is an attribute of ActRelationship."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"RSON","display":"has reason"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Definition: The source act is performed to block the effects of the target act.  This act relationship should be used when describing near miss type incidents where potential harm could have occurred, but the action described in the source act blocked the potential harmful effects of the incident actually occurring."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"BLOCK","display":"blocks"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intended to help establish the presence of a (an adverse) situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"DIAG","display":"diagnoses"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intented to provide immunity against the effects of the target act (the target act describes an infectious disease)"}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"IMM","display":"immunization against"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intended to provide active immunity against the effects of the target act (the target act describes an infectious disease)"}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"ACTIMM","display":"active immunization against"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intended to provide passive immunity against the effects of the target act (the target act describes an infectious disease)."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"PASSIMM","display":"passive immunization against"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"The source act removes or lessens the occurrence or effect of the target act."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"MITGT","display":"mitigates"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Definition: The source act is performed to recover from the effects of the target act."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"RCVY","display":"recovers"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intended to reduce the risk of of an adverse situation to emerge as described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"PRYLX","display":"prophylaxis of"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intended to improve a pre-existing adverse situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"TREAT","display":"treats"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intended to offer an additional treatment for the management or cure of a pre-existing adverse situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature.  It is not a requirement that the non-adjunctive treatment is explicitly specified."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"ADJUNCT","display":"adjunctive treatment"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intended to provide long term maintenance improvement or management of a pre-existing adverse situation described by the target act. This is not limited to diseases but can apply to any adverse situation or condition of medical or technical nature."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"MTREAT","display":"maintenance treatment"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intended to provide palliation for the effects of the target act."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"PALLTREAT","display":"palliates"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: The source act is intented to provide symptomatic relief for the effects of the target act."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"SYMP","display":"symptomatic relief"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A pre-condition that if true should result in the source Act being executed.  The target is in typically in criterion mood.  When reported after the fact (i.e. the criterion has been met) it may be in Event mood.  A delay between the trigger and the triggered action can be specified.                                                      Discussion: This includes the concept of a  required act for a service or financial instrument such as an insurance plan or policy. In such cases, the trigger is the occurrence of a specific condition such as coverage limits being exceeded."}],"system":"http://hl7.org/fhir/v3/ActRelationshipType","code":"TRIG","display":"has trigger"}]}}