{"resourceType":"ValueSet","text":{"status":"generated","div":"<div>\n      This value set to be used to identify the type of agent that is signing. This is related but different to the signature type. \n\t  This value set includes sample Contract Signer Type codes.\n    <hr/><h2>Contract Signer Type Codes</h2><p>This value set includes sample Contract Signer Type codes.</p><p><b>Copyright Statement:</b> This is an example set based on ASTM Standard, E1762-95 (2013) HL7 RoleClass OID 2.16.840.1.113883.5.110, HL7 Role Code 2.16.840.1.113883.5.111, HL7 ParticipationType OID: 2.16.840.1.113883.5.90, HL7 ParticipationFunction codes at OID: 2.16.840.1.113883.5.88, and HL7 Security and Privacy Domain Analysis Model roles classes.</p><p>This value set has an inline code system http://www.hl7.org/fhir/contractsignertypecodes, which defines the following codes:</p><table class=\"codes\"><tr><td><b>Code</b></td><td><b>Display</b></td><td><b>Definition</b></td></tr><tr><td>AMENDER<a name=\"AMENDER\"> </a></td><td>amender</td><td>A person who has corrected, edited, or amended pre-existing information.</td></tr><tr><td>AUTHN<a name=\"AUTHN\"> </a></td><td>authenticator</td><td>A person in the role of verifier who attests to the accuracy of an act, but who does not have privileges to legally authenticate information content. An example would be a resident physician who sees a patient and dictates a note, then later signs it. The resident’s signature constitutes an authentication.</td></tr><tr><td>AUT<a name=\"AUT\"> </a></td><td>author</td><td>An entity that authored specific content. There can be multiple authors of content, which may take such forms as a contract, a healthcare record entry or document, a policy, or a consent directive.</td></tr><tr><td>AFFL<a name=\"AFFL\"> </a></td><td>affiliate</td><td>An entity that has a business or professional relationship with another entity in accordance with an agreement.</td></tr><tr><td>AGNT<a name=\"AGNT\"> </a></td><td>agent</td><td>An entity that acts or is authorized to act on behalf of another entity in accordance with an agreement.</td></tr><tr><td>ASSIGNED<a name=\"ASSIGNED\"> </a></td><td>assigned entity</td><td>An agent role in which the agent is an Entity acting in the employ of an organization. The focus is on functional role on behalf of the organization, unlike the Employee role where the focus is on the 'Human Resources' relationship between the employee and the organization.</td></tr><tr><td>CIT<a name=\"CIT\"> </a></td><td>citizen</td><td>The member of a jurisdiction afforded certain rights and encumbered with certain obligation in accordance with jurisdictional policy.</td></tr><tr><td>CLAIMANT<a name=\"CLAIMANT\"> </a></td><td>claimant</td><td>A party that makes a claim for coverage under a policy.</td></tr><tr><td>COAUTH<a name=\"COAUTH\"> </a></td><td>co-author</td><td>The entity that co-authored content. There can be multiple co-authors of content,which may take such forms as a  such as a contract, a healthcare record entry or document, a policy, or a consent directive.</td></tr><tr><td>CONSENTER<a name=\"CONSENTER\"> </a></td><td>consenter</td><td>A patient or patient representative who is the grantee in a healthcare related agreement such as a consent for healthcare services, advanced directive, or a privacy consent directive in accordance with jurisdictional, organizational, or patient policy.</td></tr><tr><td>CONSWIT<a name=\"CONSWIT\"> </a></td><td>consent witness</td><td>A person who has witnessed and attests to observing a patient being counseled about a healthcare related agreement such as a consent for healthcare services, advanced directive, or a privacy consent directive.</td></tr><tr><td>CONT<a name=\"CONT\"> </a></td><td>contact</td><td>A person or an organization that provides or receives information regarding another entity. Examples; patient NOK and emergency contacts; guarantor contact; employer contact.</td></tr><tr><td>COPART<a name=\"COPART\"> </a></td><td>co-participant</td><td>A person who participates in the generation of and attest to veracity of content, but is not an author or co-author. For example a surgeon who is required by institutional, regulatory, or legal rules to sign an operative report, but who was not involved in the authorship of that report.</td></tr><tr><td>COVPTY<a name=\"COVPTY\"> </a></td><td>covered party</td><td>An entity, which is the insured, that receives benefits such as healthcare services, reimbursement for out-of-pocket expenses, or compensation for losses through coverage under the terms of an insurance policy. The underwriter of that policy is the scoping entity. The covered party receives coverage because of some contractual or other relationship with the holder of that policy. Note that a particular policy may cover several individuals one of whom may be, but need not be, the policy holder. Thus the notion of covered party is a role that is distinct from that of the policy holder.</td></tr><tr><td>DELEGATEE<a name=\"DELEGATEE\"> </a></td><td>delegatee</td><td>A party to whom some right or authority is delegated by a delegator.</td></tr><tr><td>delegator<a name=\"delegator\"> </a></td><td>delegator</td><td>A party that delegates a right or authority to another party.</td></tr><tr><td>DEPEND<a name=\"DEPEND\"> </a></td><td>dependent</td><td>A person covered under an insurance policy or program based on an association with a subscriber, which is recognized by the policy holder. The dependent has an association with the subscriber such as a financial dependency or personal relationship such as that of a spouse, or a natural or adopted child. The policy holder may be required by law to recognize certain associations or may have discretion about the associations. For example, a policy holder may dictate the criteria for the dependent status of adult children who are students, such as requiring full time enrollment, or may recognize domestic partners as dependents. Under certain circumstances, the dependent may be under the indirect authority of a responsible party acting as a surrogate for the subscriber, for example, if the subscriber is differently-abled or deceased, a guardian ad Lidem or estate executor may be appointed to assume the subscriber’s legal standing in the relationship with the dependent.</td></tr><tr><td>DPOWATT<a name=\"DPOWATT\"> </a></td><td>durable power of attorney</td><td>A person who has been granted the authority to represent or act on another's behalf generally in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts. Unlike ordinary powers of attorney, durable powers can survive for long periods of time, and again, unlike standard powers of attorney, durable powers can continue after incompetency.</td></tr><tr><td>EMGCON<a name=\"EMGCON\"> </a></td><td>emergency contact</td><td>An entity to be contacted in the event of an emergency</td></tr><tr><td>EVTWIT<a name=\"EVTWIT\"> </a></td><td>event witness</td><td>A person who attests to observing an occurrence.  For example, the witness has observed a procedure and is attesting to this fact.</td></tr><tr><td>EXCEST<a name=\"EXCEST\"> </a></td><td>executor of estate</td><td>A person who has been granted the authority to act as an estate executor for a deceased person who was the responsible party.</td></tr><tr><td>GRANTEE<a name=\"GRANTEE\"> </a></td><td>grantee</td><td>A person who grants to another person the authority to represent or act on that person’s behalf.  Examples include (1) exercising specific rights belonging to the grantee; (2) performing specific duties on behalf of a grantee; and (3) making specific decisions concerning a grantee.</td></tr><tr><td>GRANTOR<a name=\"GRANTOR\"> </a></td><td>grantor</td><td>A person who has been granted the authority to represent or act on another’s behalf. Examples include (1) exercising specific rights belonging to the grantee; (2) performing specific duties on behalf of a grantee; and (3) making specific decisions concerning a grantee.</td></tr><tr><td>GUAR<a name=\"GUAR\"> </a></td><td>guarantor</td><td>A person or organization contractually recognized by the issuer as an entity that has assumed fiscal responsibility (e.g., by making or giving a promise, assurance, or pledge) for another entity’s financial obligations by guaranteeing to pay for amounts owed to a particular account.  In a healthcare context, the account may be a patient’s billing account for services rendered by a provider or a health plan premium account.</td></tr><tr><td>GUARD<a name=\"GUARD\"> </a></td><td>guardian</td><td>A person or organization legally empowered with responsibility for the care of a ward.</td></tr><tr><td>GUADLTM<a name=\"GUADLTM\"> </a></td><td>guardian ad lidem</td><td>A person appointed by the court to look out for the best interests of a minor child during the course of legal proceedings.</td></tr><tr><td>INF<a name=\"INF\"> </a></td><td>informant</td><td>An entity that is the source of reported information (e.g., a next of kin who answers questions about the patient's history). For history questions, the patient is logically an informant, yet the informant of history questions is implicitly the subject.</td></tr><tr><td>INTPRT<a name=\"INTPRT\"> </a></td><td>interpreter</td><td>A person who converts spoken or written language into the language of key participants in an event such as when a provider is obtaining a patient’s consent to treatment or permission to disclose information.</td></tr><tr><td>INSBJ<a name=\"INSBJ\"> </a></td><td>investigation subject</td><td>An entity that is the subject of an investigation. This role is scoped by the party responsible for the investigation.</td></tr><tr><td>HPOWATT<a name=\"HPOWATT\"> </a></td><td>healthcare power of attorney</td><td>A person who has been granted the authority to represent or act on another's behalf for healthcare related matters in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts. Examples include (1) exercising specific healthcare legal rights belonging to the grantee such as signing a consent directive; (2) performing specific healthcare related legal duties on behalf of a grantee such as claims payment; and (3) making specific healthcare legal decisions concerning a grantee such as consenting to healthcare services.</td></tr><tr><td>HPROV<a name=\"HPROV\"> </a></td><td>healthcare provider</td><td>An entity that is authorized to provide health care services by an authorizing organization or jurisdiction.</td></tr><tr><td>LEGAUTHN<a name=\"LEGAUTHN\"> </a></td><td>legal authenticator</td><td>A person in the role of verifier who attests to the accuracy of information content, and who has privileges to certify the legal authenticity of that content with a signature that constitutes a legal authentication.  For example, a licensed physician who signs a consult authored by a resident physician who authenticated it.</td></tr><tr><td>NMDINS<a name=\"NMDINS\"> </a></td><td>named insured</td><td>A party to an insurance policy under which the insurer agrees to indemnify for losses, provides benefits for, or renders services. A named insured may be either a person, non-person living subject, or an organization, or a group of persons, non-person living subject that is the named insured under a comprehensive automobile, disability, or property and casualty policy.  The named insured and may or may not be the policy holder.</td></tr><tr><td>NOK<a name=\"NOK\"> </a></td><td>next of kin</td><td>A person, who is a type of contact, designated to receive notifications on behalf of another person who is a relative.</td></tr><tr><td>NOTARY<a name=\"NOTARY\"> </a></td><td>notary</td><td>The party credentialed to legally attest to the contract binding by verifying the identity and capacity of the grantor and grantee, and witnessing their signing of the contract or agreement such as a real estate transaction, pre-nuptial agreement, or a will.</td></tr><tr><td>PAT<a name=\"PAT\"> </a></td><td>patient</td><td>A person, animal, or other living subject that is the actual or potential recipient of health care services.</td></tr><tr><td>POWATT<a name=\"POWATT\"> </a></td><td>power of attorney</td><td>A person who has been granted the authority to represent or act on another's behalf generally in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts. Examples include (1) exercising specific legal rights belonging to the grantee such as signing a contract; (2) performing specific legal duties on behalf of a grantee such as making loan payments; and (3) making specific legal decisions concerning a grantee such as financial investment decisions.</td></tr><tr><td>PRIMAUTH<a name=\"PRIMAUTH\"> </a></td><td>primary author</td><td>An entity that is the primary or sole author of information content.  In the healthcare context, there can be only one primary author of health information content in a record entry or document.</td></tr><tr><td>PRIRECIP<a name=\"PRIRECIP\"> </a></td><td>responsible party </td><td>An entity that may, should receive, or has received information or an object to which it was primarily addressed.</td></tr><tr><td>RECIP<a name=\"RECIP\"> </a></td><td>recipient</td><td>An entity that may, should receive, or has received information or an object, which may not have been primarily addressed to it. For example, the staff of a provider, a clearinghouse, or other intermediary.</td></tr><tr><td>RESPRSN<a name=\"RESPRSN\"> </a></td><td>responsible party</td><td>An entity that has legal responsibility for another party.</td></tr><tr><td>REVIEWER<a name=\"REVIEWER\"> </a></td><td>reviewer</td><td>A person, device, or algorithm that has used approved criteria for filtered data for inclusion into the patient record.  Examples: (1) a medical records clerk who scans a document for inclusion in the medical record, enters header information, or catalogues and classifies the data, or a combination thereof; (2) a gateway that receives data from another computer system and interprets that data or changes its format, or both, before entering it into the patient record.</td></tr><tr><td>TRANS<a name=\"TRANS\"> </a></td><td>transcriber</td><td>An entity entering the data into the originating system. This includes the transcriptionist for dictated text transcribed into electronic form.</td></tr><tr><td>SOURCE<a name=\"SOURCE\"> </a></td><td>source</td><td>An automated data source that generates a signature along with content. Examples: (1) the signature for an image that is generated by a device for inclusion in the patient record; (2) the signature for an ECG derived by an ECG system for inclusion in the patient record; (3) the data from a biomedical monitoring device or system that is for inclusion in the patient record.</td></tr><tr><td>SPOWATT<a name=\"SPOWATT\"> </a></td><td>special power of attorney</td><td>A person who has been granted the authority to represent or act on another's behalf for a limited set of specific matters in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts. Examples include (1) exercising specific legal rights belonging to the grantee such as drafting a will; (2) performing specific legal duties on behalf of a grantee such as making a reversible mortgage to pay for end of life expenses; and (3) making specific legal decisions concerning a grantee such as managing a trust.</td></tr><tr><td>VALID<a name=\"VALID\"> </a></td><td>validator</td><td>A person who validates a health information document for inclusion in the patient record. For example, a medical student or resident is credentialed to perform history or physical examinations and to write progress notes. The attending physician signs the history and physical examination to validate the entry for inclusion in the patient's medical record.</td></tr><tr><td>VERF<a name=\"VERF\"> </a></td><td>verifier</td><td>A person who asserts the correctness and appropriateness of an act or the recording of the act, and is accountable for the assertion that the act or the recording of the act complies with jurisdictional or organizational policy. For example, a physician is required to countersign a verbal order that has previously been recorded in the medical record by a registered nurse who has carried out the verbal order.</td></tr><tr><td>WIT<a name=\"WIT\"> </a></td><td>witness</td><td>A person witnessing the signature of another party. A witness is not knowledgeable about the content being signed, much less approves of anything stated in the content. For example, an advanced directive witness or a witness that a party to a contract signed that certain demographic or financial information is truthful.</td></tr></table></div>"},"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-oid","valueUri":"urn:oid:2.16.840.1.113883.4.642.2.99"}],"url":"http://hl7.org/fhir/ValueSet/contract-signer-type","version":"1.3.0","name":"Contract Signer Type Codes","status":"draft","experimental":true,"publisher":"Financial Management","contact":[{"telecom":[{"system":"other","value":"http://hl7.org/fhir"},{"system":"email","value":"fhir@lists.hl7.org"}]}],"date":"2016-02-22T22:46:02+11:00","description":"This value set includes sample Contract Signer Type codes.","copyright":"This is an example set based on ASTM Standard, E1762-95 (2013) HL7 RoleClass OID 2.16.840.1.113883.5.110, HL7 Role Code 2.16.840.1.113883.5.111, HL7 ParticipationType OID: 2.16.840.1.113883.5.90, HL7 ParticipationFunction codes at OID: 2.16.840.1.113883.5.88, and HL7 Security and Privacy Domain Analysis Model roles classes.","extensible":true,"codeSystem":{"system":"http://www.hl7.org/fhir/contractsignertypecodes","caseSensitive":true,"concept":[{"code":"AMENDER","display":"amender","definition":"A person who has corrected, edited, or amended pre-existing information."},{"code":"AUTHN","display":"authenticator","definition":"A person in the role of verifier who attests to the accuracy of an act, but who does not have privileges to legally authenticate information content. An example would be a resident physician who sees a patient and dictates a note, then later signs it. The resident’s signature constitutes an authentication."},{"code":"AUT","display":"author","definition":"An entity that authored specific content. There can be multiple authors of content, which may take such forms as a contract, a healthcare record entry or document, a policy, or a consent directive."},{"code":"AFFL","display":"affiliate","definition":"An entity that has a business or professional relationship with another entity in accordance with an agreement."},{"code":"AGNT","display":"agent","definition":"An entity that acts or is authorized to act on behalf of another entity in accordance with an agreement."},{"code":"ASSIGNED","display":"assigned entity","definition":"An agent role in which the agent is an Entity acting in the employ of an organization. The focus is on functional role on behalf of the organization, unlike the Employee role where the focus is on the 'Human Resources' relationship between the employee and the organization."},{"code":"CIT","display":"citizen","definition":"The member of a jurisdiction afforded certain rights and encumbered with certain obligation in accordance with jurisdictional policy."},{"code":"CLAIMANT","display":"claimant","definition":"A party that makes a claim for coverage under a policy."},{"code":"COAUTH","display":"co-author","definition":"The entity that co-authored content. There can be multiple co-authors of content,which may take such forms as a  such as a contract, a healthcare record entry or document, a policy, or a consent directive."},{"code":"CONSENTER","display":"consenter","definition":"A patient or patient representative who is the grantee in a healthcare related agreement such as a consent for healthcare services, advanced directive, or a privacy consent directive in accordance with jurisdictional, organizational, or patient policy."},{"code":"CONSWIT","display":"consent witness","definition":"A person who has witnessed and attests to observing a patient being counseled about a healthcare related agreement such as a consent for healthcare services, advanced directive, or a privacy consent directive."},{"code":"CONT","display":"contact","definition":"A person or an organization that provides or receives information regarding another entity. Examples; patient NOK and emergency contacts; guarantor contact; employer contact."},{"code":"COPART","display":"co-participant","definition":"A person who participates in the generation of and attest to veracity of content, but is not an author or co-author. For example a surgeon who is required by institutional, regulatory, or legal rules to sign an operative report, but who was not involved in the authorship of that report."},{"code":"COVPTY","display":"covered party","definition":"An entity, which is the insured, that receives benefits such as healthcare services, reimbursement for out-of-pocket expenses, or compensation for losses through coverage under the terms of an insurance policy. The underwriter of that policy is the scoping entity. The covered party receives coverage because of some contractual or other relationship with the holder of that policy. Note that a particular policy may cover several individuals one of whom may be, but need not be, the policy holder. Thus the notion of covered party is a role that is distinct from that of the policy holder."},{"code":"DELEGATEE","display":"delegatee","definition":"A party to whom some right or authority is delegated by a delegator."},{"code":"delegator","display":"delegator","definition":"A party that delegates a right or authority to another party."},{"code":"DEPEND","display":"dependent","definition":"A person covered under an insurance policy or program based on an association with a subscriber, which is recognized by the policy holder. The dependent has an association with the subscriber such as a financial dependency or personal relationship such as that of a spouse, or a natural or adopted child. The policy holder may be required by law to recognize certain associations or may have discretion about the associations. For example, a policy holder may dictate the criteria for the dependent status of adult children who are students, such as requiring full time enrollment, or may recognize domestic partners as dependents. Under certain circumstances, the dependent may be under the indirect authority of a responsible party acting as a surrogate for the subscriber, for example, if the subscriber is differently-abled or deceased, a guardian ad Lidem or estate executor may be appointed to assume the subscriber’s legal standing in the relationship with the dependent."},{"code":"DPOWATT","display":"durable power of attorney","definition":"A person who has been granted the authority to represent or act on another's behalf generally in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts. Unlike ordinary powers of attorney, durable powers can survive for long periods of time, and again, unlike standard powers of attorney, durable powers can continue after incompetency."},{"code":"EMGCON","display":"emergency contact","definition":"An entity to be contacted in the event of an emergency"},{"code":"EVTWIT","display":"event witness","definition":"A person who attests to observing an occurrence.  For example, the witness has observed a procedure and is attesting to this fact."},{"code":"EXCEST","display":"executor of estate","definition":"A person who has been granted the authority to act as an estate executor for a deceased person who was the responsible party."},{"code":"GRANTEE","display":"grantee","definition":"A person who grants to another person the authority to represent or act on that person’s behalf.  Examples include (1) exercising specific rights belonging to the grantee; (2) performing specific duties on behalf of a grantee; and (3) making specific decisions concerning a grantee."},{"code":"GRANTOR","display":"grantor","definition":"A person who has been granted the authority to represent or act on another’s behalf. Examples include (1) exercising specific rights belonging to the grantee; (2) performing specific duties on behalf of a grantee; and (3) making specific decisions concerning a grantee."},{"code":"GUAR","display":"guarantor","definition":"A person or organization contractually recognized by the issuer as an entity that has assumed fiscal responsibility (e.g., by making or giving a promise, assurance, or pledge) for another entity’s financial obligations by guaranteeing to pay for amounts owed to a particular account.  In a healthcare context, the account may be a patient’s billing account for services rendered by a provider or a health plan premium account."},{"code":"GUARD","display":"guardian","definition":"A person or organization legally empowered with responsibility for the care of a ward."},{"code":"GUADLTM","display":"guardian ad lidem","definition":"A person appointed by the court to look out for the best interests of a minor child during the course of legal proceedings."},{"code":"INF","display":"informant","definition":"An entity that is the source of reported information (e.g., a next of kin who answers questions about the patient's history). For history questions, the patient is logically an informant, yet the informant of history questions is implicitly the subject."},{"code":"INTPRT","display":"interpreter","definition":"A person who converts spoken or written language into the language of key participants in an event such as when a provider is obtaining a patient’s consent to treatment or permission to disclose information."},{"code":"INSBJ","display":"investigation subject","definition":"An entity that is the subject of an investigation. This role is scoped by the party responsible for the investigation."},{"code":"HPOWATT","display":"healthcare power of attorney","definition":"A person who has been granted the authority to represent or act on another's behalf for healthcare related matters in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts. Examples include (1) exercising specific healthcare legal rights belonging to the grantee such as signing a consent directive; (2) performing specific healthcare related legal duties on behalf of a grantee such as claims payment; and (3) making specific healthcare legal decisions concerning a grantee such as consenting to healthcare services."},{"code":"HPROV","display":"healthcare provider","definition":"An entity that is authorized to provide health care services by an authorizing organization or jurisdiction."},{"code":"LEGAUTHN","display":"legal authenticator","definition":"A person in the role of verifier who attests to the accuracy of information content, and who has privileges to certify the legal authenticity of that content with a signature that constitutes a legal authentication.  For example, a licensed physician who signs a consult authored by a resident physician who authenticated it."},{"code":"NMDINS","display":"named insured","definition":"A party to an insurance policy under which the insurer agrees to indemnify for losses, provides benefits for, or renders services. A named insured may be either a person, non-person living subject, or an organization, or a group of persons, non-person living subject that is the named insured under a comprehensive automobile, disability, or property and casualty policy.  The named insured and may or may not be the policy holder."},{"code":"NOK","display":"next of kin","definition":"A person, who is a type of contact, designated to receive notifications on behalf of another person who is a relative."},{"code":"NOTARY","display":"notary","definition":"The party credentialed to legally attest to the contract binding by verifying the identity and capacity of the grantor and grantee, and witnessing their signing of the contract or agreement such as a real estate transaction, pre-nuptial agreement, or a will."},{"code":"PAT","display":"patient","definition":"A person, animal, or other living subject that is the actual or potential recipient of health care services."},{"code":"POWATT","display":"power of attorney","definition":"A person who has been granted the authority to represent or act on another's behalf generally in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts. Examples include (1) exercising specific legal rights belonging to the grantee such as signing a contract; (2) performing specific legal duties on behalf of a grantee such as making loan payments; and (3) making specific legal decisions concerning a grantee such as financial investment decisions."},{"code":"PRIMAUTH","display":"primary author","definition":"An entity that is the primary or sole author of information content.  In the healthcare context, there can be only one primary author of health information content in a record entry or document."},{"code":"PRIRECIP","display":"responsible party ","definition":"An entity that may, should receive, or has received information or an object to which it was primarily addressed."},{"code":"RECIP","display":"recipient","definition":"An entity that may, should receive, or has received information or an object, which may not have been primarily addressed to it. For example, the staff of a provider, a clearinghouse, or other intermediary."},{"code":"RESPRSN","display":"responsible party","definition":"An entity that has legal responsibility for another party."},{"code":"REVIEWER","display":"reviewer","definition":"A person, device, or algorithm that has used approved criteria for filtered data for inclusion into the patient record.  Examples: (1) a medical records clerk who scans a document for inclusion in the medical record, enters header information, or catalogues and classifies the data, or a combination thereof; (2) a gateway that receives data from another computer system and interprets that data or changes its format, or both, before entering it into the patient record."},{"code":"TRANS","display":"transcriber","definition":"An entity entering the data into the originating system. This includes the transcriptionist for dictated text transcribed into electronic form."},{"code":"SOURCE","display":"source","definition":"An automated data source that generates a signature along with content. Examples: (1) the signature for an image that is generated by a device for inclusion in the patient record; (2) the signature for an ECG derived by an ECG system for inclusion in the patient record; (3) the data from a biomedical monitoring device or system that is for inclusion in the patient record."},{"code":"SPOWATT","display":"special power of attorney","definition":"A person who has been granted the authority to represent or act on another's behalf for a limited set of specific matters in a manner which is a legally binding upon the person giving such authority as if he or she personally were to do the acts. Examples include (1) exercising specific legal rights belonging to the grantee such as drafting a will; (2) performing specific legal duties on behalf of a grantee such as making a reversible mortgage to pay for end of life expenses; and (3) making specific legal decisions concerning a grantee such as managing a trust."},{"code":"VALID","display":"validator","definition":"A person who validates a health information document for inclusion in the patient record. For example, a medical student or resident is credentialed to perform history or physical examinations and to write progress notes. The attending physician signs the history and physical examination to validate the entry for inclusion in the patient's medical record."},{"code":"VERF","display":"verifier","definition":"A person who asserts the correctness and appropriateness of an act or the recording of the act, and is accountable for the assertion that the act or the recording of the act complies with jurisdictional or organizational policy. For example, a physician is required to countersign a verbal order that has previously been recorded in the medical record by a registered nurse who has carried out the verbal order."},{"code":"WIT","display":"witness","definition":"A person witnessing the signature of another party. A witness is not knowledgeable about the content being signed, much less approves of anything stated in the content. For example, an advanced directive witness or a witness that a party to a contract signed that certain demographic or financial information is truthful."}]},"expansion":{"identifier":"urn:uuid:ed4f51d9-fa1b-46b9-adc1-c15d26ee356c","timestamp":"2016-02-22T22:52:35+11:00","parameter":[{"name":"version","valueUri":"http://hl7.org/fhir/ValueSet/contract-signer-type?version=1.3.0"}],"contains":[{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"AMENDER","display":"amender"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"AUTHN","display":"authenticator"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"AUT","display":"author"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"AFFL","display":"affiliate"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"AGNT","display":"agent"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"ASSIGNED","display":"assigned entity"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"CIT","display":"citizen"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"CLAIMANT","display":"claimant"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"COAUTH","display":"co-author"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"CONSENTER","display":"consenter"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"CONSWIT","display":"consent witness"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"CONT","display":"contact"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"COPART","display":"co-participant"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"COVPTY","display":"covered party"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"DELEGATEE","display":"delegatee"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"delegator","display":"delegator"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"DEPEND","display":"dependent"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"DPOWATT","display":"durable power of attorney"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"EMGCON","display":"emergency contact"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"EVTWIT","display":"event witness"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"EXCEST","display":"executor of estate"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"GRANTEE","display":"grantee"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"GRANTOR","display":"grantor"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"GUAR","display":"guarantor"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"GUARD","display":"guardian"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"GUADLTM","display":"guardian ad lidem"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"INF","display":"informant"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"INTPRT","display":"interpreter"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"INSBJ","display":"investigation subject"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"HPOWATT","display":"healthcare power of attorney"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"HPROV","display":"healthcare provider"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"LEGAUTHN","display":"legal authenticator"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"NMDINS","display":"named insured"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"NOK","display":"next of kin"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"NOTARY","display":"notary"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"PAT","display":"patient"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"POWATT","display":"power of attorney"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"PRIMAUTH","display":"primary author"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"PRIRECIP","display":"responsible party "},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"RECIP","display":"recipient"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"RESPRSN","display":"responsible party"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"REVIEWER","display":"reviewer"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"TRANS","display":"transcriber"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"SOURCE","display":"source"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"SPOWATT","display":"special power of attorney"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"VALID","display":"validator"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"VERF","display":"verifier"},{"system":"http://www.hl7.org/fhir/contractsignertypecodes","code":"WIT","display":"witness"}]}}