{"resourceType":"ValueSet","expansion":{"identifier":"urn:uuid:9ca60702-c232-4fba-9ea4-ea07c348badc","timestamp":"2016-03-09T12:48:36Z","contains":[{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"An association between two Entities where the playing Entity is considered in some way \"part\" of the scoping Entity, e.g. as a member, component, ingredient, or content. Being \"part\" in the broadest sense of the word can mean anything from being an integral structural component to a mere incidental temporary association of a playing Entity with a (generally larger) scoping Entity."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"_RoleClassPartitive","display":"RoleClassPartitive"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Relates a material as the content (player) to a container (scoper).  Unlike ingredients, the content and a container remain separate (not mixed) and the content can be removed from the container.  A content is not part of an empty container."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"CONT","display":"content"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"An exposure agent carrier is an entity that is capable of conveying an exposure agent from one entity to another.  The scoper of the role must be the exposure agent (e.g. pathogen)."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"EXPAGTCAR","display":"exposure agent carrier"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: A vector is a living subject that carries an exposure agent.  The vector does not cause the disease itself, but exposes targets to the exposure agent.  A mosquito carrying malaria is an example of a vector.  The scoper of the role must be the exposure agent (e.g. pathogen)."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"EXPVECTOR","display":"exposure vector"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: A fomite is a non-living entity that is capable of conveying exposure agent from one entity to another.  A doorknob contaminated with a Norovirus is an example of a fomite.  Anyone touching the doorknob would be exposed to the virus.  The scoper of the role must be the exposure agent (e.g. pathogen)."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"FOMITE","display":"fomite"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Relates a component (player) to a mixture (scoper); e.g. Glucose and Water are ingredients of D5W, latex may be an ingredient in a tracheal tube."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"INGR","display":"ingredient"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Definition: a therapeutically active ingredient (player) in a mixture (scoper), where the mixture is typically a manufactured pharmaceutical.  It is unknown if the quantity of such an ingredient is expressed precisely in terms of the playing ingredient substance, or, if it is specified in terms of a closely related substance (active moiety or reference substance)."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"ACTI","display":"active ingredient"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description:  Active ingredient, where the ingredient substance (player) is itself the \"basis of strength\", i.e., where the Role.quantity specifies exactly the quantity of the player substance in the medicine formulation.                                                       Examples: Lopressor 50 mg actually contains 50 mg of metoprolol succinate, even though the active moiety is metoprolol,  but also: Tenormin 50 mg contain 50 mg of atenolol, as free base, i.e., where the active ingredient atenolol is also the active moiety."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"ACTIB","display":"active ingredient - basis of strength"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: Active ingredient, where not the ingredient substance (player), but itaTMs active moiety is the \"basis of strength\", i.e., where the Role.quantity specifies the quantity of the player substance's active moiety in the medicine formulation.                                                      Examples: 1 mL of Betopic 5mg/mL eye drops contains 5.6 mg betaxolol hydrochloride equivalent to betaxolol base 5 mg."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"ACTIM","display":"active ingredient - moiety is basis of strength"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Description: Active ingredient, where not the ingredient substance (player) but another reference substance with the same active moiety, is the \"basis of strength\", i.e., where the Role.quantity specifies the quantity of a reference substance, similar but different from the player substance's in the medicine formulation.                                                      Examples: Toprol-XL 50 mg contains 47.5 mg of metoprolol succinate equivalent to 50 mg of metoprolol tartrate."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"ACTIR","display":"active ingredient - reference substance is basis of strength"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A component (player) added to enhance the action of an active ingredient (scoper) (in the manner of a catalyst) but which has no active effect in and of itself.  Such ingredients are significant in defining equivalence of products in a way that inactive ingredients are not."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"ADJV","display":"adjuvant"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"An ingredient (player)  that is added to a base (scoper), that amounts to a minor part of the overall mixture."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"ADTV","display":"additive"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A base ingredient (player) is what comprises the major part of a mixture (scoper); e.g. Water in most i.v. solutions, or Vaseline in salves. Among all ingredients of a material, there should be only one base. A base substance can, in turn, be a mixture."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"BASE","display":"base"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"An ingredient whose presence is not intended but may not be reasonably avoided given the circumstances of the mixture's nature or origin."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"CNTM","display":"contaminant ingredient"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"An ingredient which is not considered therapeutically active, e.g. colors, flavors, stabilizers, or preservatives, fillers, or structural components added to an active ingredient in order to facilitate administration of the active ingredient but without being considered therapeutically active. An inactive ingredient need not be biologically inert, e.g. might be active as an allergen or might have a pleasant taste, but is not an essential constituent delivering the therapeutic effect."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"IACT","display":"inactive ingredient"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A substance (player) influencing the optical aspect of material (scoper)."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"COLR","display":"color additive"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A substance (player) added to a mixture (scoper) to make it taste a certain way.  In food the use is obvious, in pharmaceuticals flavors can hide disgusting taste of the active ingredient (important in pediatric treatments)."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"FLVR","display":"flavor additive"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A substance (player) added to a mixture (scoper) to prevent microorganisms (fungi, bacteria) to spoil the mixture."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"PRSV","display":"preservative"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A stabilizer (player) added to a mixture (scoper) in order to prevent the molecular disintegration of the main substance."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"STBL","display":"stabilizer"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"An ingredient (player) of a medication (scoper) that is inseparable from the active ingredients, but has no intended chemical or pharmaceutical effect itself, but which may have some systemic effect on the patient.                          An example is a collagen matrix used as a base for transplanting skin cells.  The collagen matrix can be left permanently in the graft site.  Because it is of bovine origin, the patient may exhibit allergies or may have cultural objections to its use."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"MECH","display":"mechanical ingredient"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Relates an entity (player) to a location (scoper) at which it is present in some way. This presence may be limited in time."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"LOCE","display":"located entity"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Relates an entity (player) (e.g. a device) to a location (scoper) at which it is normally found or stored when not used."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"STOR","display":"stored entity"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A role played by an entity that is a member of a group.  The group provides the scope for this role.                          Among other uses, groups as used in insurance (groups of covered individuals) and in scheduling where resources may be grouped for scheduling and logistical purposes."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"MBR","display":"member"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Definition:  an association between two Entities where the playing Entity (the part) is a component of the whole (scoper) in the sense of an integral structural component, that is distinct from other parts in the same whole, has a distinct function in the whole, and, as an effect, the full integrity of the whole depends (to some degree) on the presence of this part, even though the part may often be separable from the whole.                                                      Discussion: Part is defined in opposition to (a) ingredient (not separable), (b) content (not a functional component), and (c) member (not functionally distinct from other members)."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"PART","display":"part"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"The molecule or ion that is responsible for the intended pharmacological action of the drug substance, excluding those appended or associated parts of the molecule that make the molecule an ester, salt (including a salt with hydrogen or coordination bonds), or other noncovalent derivative (such as a complex, chelate, or clathrate).                          Examples: heparin-sodium and heparin-potassium have the same active moiety, heparin; the active moiety of morphine-hydrochloride is morphine."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"ACTM","display":"active moiety"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A role played by a material entity that is a specimen for an act. It is scoped by the source of the specimen."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"SPEC","display":"specimen"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A portion (player) of an original or source specimen (scoper) used for testing or transportation."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"ALQT","display":"aliquot"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A microorganism that has been isolated from other microorganisms or a source matrix."}],"system":"http://hl7.org/fhir/v3/RoleClass","code":"ISLT","display":"isolate"}]}}