{"resourceType":"ValueSet","expansion":{"identifier":"urn:uuid:f8d7081c-0a02-455e-9321-b897d2e30bb6","timestamp":"2016-03-07T21:49:08Z","contains":[{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Parties that may or should contribute or have contributed information to the Act. Such information includes information leading to the decision to perform the Act and how to perform the Act (e.g. consultant), information that the Act itself seeks to reveal (e.g. informant of clinical history), or information about what Act was performed (e.g. informant witness)."}],"system":"http://hl7.org/fhir/v3/ParticipationType","code":"_ParticipationInformationGenerator","display":"ParticipationInformationGenerator"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Definition: A party that originates the Act and therefore has responsibility for the information given in the Act and ownership of this Act.                                                      Example: the report writer, the person writing the act definition, the guideline author, the placer of an order, the EKG cart (device) creating a report etc. Every Act should have an author. Authorship is regardless of mood always actual authorship.                           Examples of such policies might include:                                                                                     The author and anyone they explicitly delegate may update the report;                                                                                        All administrators within the same clinic may cancel and reschedule appointments created by other administrators within that clinic;                                                                               A party that is neither an author nor a party who is extended authorship maintenance rights by policy, may only amend, reverse, override, replace, or follow up in other ways on this Act, whereby the Act remains intact and is linked to another Act authored by that other party."}],"system":"http://hl7.org/fhir/v3/ParticipationType","code":"AUT","display":"author (originator)"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A source of reported information (e.g. a next of kin who answers questions about the patient's history).  For history questions, the patient is logically an informant, yet the informant of history questions is implicitly the subject."}],"system":"http://hl7.org/fhir/v3/ParticipationType","code":"INF","display":"informant"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"An entity entering the data into the originating system. The data entry entity is collected optionally for internal quality control purposes. This includes the transcriptionist for dictated text transcribed into electronic form."}],"system":"http://hl7.org/fhir/v3/ParticipationType","code":"TRANS","display":"Transcriber"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"A person entering the data into the originating system.  The data entry person is collected optionally for internal quality control purposes.  This includes the transcriptionist for dictated text."}],"system":"http://hl7.org/fhir/v3/ParticipationType","code":"ENT","display":"data entry person"},{"extension":[{"url":"http://hl7.org/fhir/StructureDefinition/valueset-definition","valueString":"Only with service events.  A person witnessing the action happening without doing anything.  A witness is not necessarily aware, much less approves of anything stated in the service event.  Example for a witness is students watching an operation or an advanced directive witness."}],"system":"http://hl7.org/fhir/v3/ParticipationType","code":"WIT","display":"witness"}]}}